let heart = document.getElementById("heart");
let message = document.getElementById("message");

heart.onclick = () => {
    heart.style.color = "#fff";
    heart.innerHTML = "🎉🌟 نورااااااا كل سنة و انتي طيبة😂❤🥰 🌟🎉";
    message.innerHTML = `كل سنة و انتي طيبه و جميله كما انتي دائما ,النهارده عيد ميلادك عايز اقولك اني مبسوط علشان كل يوك كل ساعه كل لحظه كنا فيها مع بعض انتي مش مجرد صديقه انتي اخت و قلب قريب مني جدا ❤<br><br>
                        عايز اشكرك من أعماق قلبي على كل لحظه قضتيها معايا و على كل ضحكه ضحكناها مع بعض على كل الهموم الي كنتي بتشيليها من عليا على كل نصيحه قدمتيها ليا بكل صدق و حب عايز اشكرك على  دعمك ليا في كل الأوقات الفرح و الحزن في النجاح و الفشل انتي دايما كنتي معايا و والله وجودك في حياتي نعمه لا تقدر ب ثمن🤍🤍🤍🤍<br><br>
                        انتي الشخص الي بقدر أكون نفسي معاه من غير تصنع او خوف علمتيني كتير و أوقات كتير كنتي بتحولي حياتي لسعاده ,انا مقدرش اتخيل حياتي من غيرك ابدا وجودك دا بيمدني بقوة و تحفيز و كل شعور حلو 😄🥰<br><br>
                        في اليوم المميز دا بتمنى ليكي كل سعادة الي تستحقيها و أتمنى يكون عامك الجديد كله حب و فرح و نجاح و تفوق انتي تستحقي كل خير و يا رب تحققي كل احلامك و اهدافك يا نورا🤲❤<br><br>
                        شكرا يا نورا بجد علشان كنتي دايما موجوده جمبي علشان حياتي تكون افضل انا محظوظ جدا علشان عندي اخت زيك ❤❤<br><br>
                        بحبك جدا و أتمنى ليكي عيد ميلاد سعيد كله فرح و مفاجآت جميله , كل سنة و انتي بألف خير يا اجمل نورا نورت حياتي ❤❤`;
    message.style.display = "block";
    
    // إطلاق قصاصات الورق الملونة
    confetti({
        particleCount: 100,
        spread: 70,
        origin: { y: 0.6 }
    });
};
